Revit 2026 API

# ElementUniqueId Property

---

A stable unique identifier for an element within the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string UniqueId { get; }
```
```vb
Public ReadOnly Property UniqueId As String
	Get
```
```cpp
public:
property String^ UniqueId {
	String^ get ();
}
```
```fsharp
member UniqueId : string with get
```

#### Property Value

String

The UniqueId can be used to store an identifier in an external database and to retrieve the same element in the future if it still exists. This id can be passed to the Document's Element property to retrieve the element. The UniqueId is stable across upgrades and workset operations such as Save To Central, while the ElementId property may change.

#### Reference

Element Class

Autodesk.Revit.DB Namespace